<template lang="pug">
  div.pandect
    bread-crumbs
    div.container
      sidebar(title="通谱总论" v-bind:items="sidebarItems" v-on:itemClick="itemClick")
      main-article(title="通谱总论")
        div.article(slot="cnt")
          div.w
            div.t 引论
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 序
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 凡例
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 中华民族共祖
            div.p
              |黄帝（公元前2717年-公元前2599年）：古华夏部落联盟首领，中国远古时代华夏民族的共主。五帝之首。被尊为中华“人文初祖”。据说他是少典与附宝之子，本姓公孙，后改姬姓，故称姬轩辕。居轩辕之丘，号轩辕氏，建都于有熊，亦称有熊氏。也有人称之为“帝鸿氏”。
              br
              |炎帝，中国上古时期姜姓部落的首领尊称，号神农氏，又号魁隗氏、连山氏、列山氏，别号朱襄（尚有争议，也有说朱襄氏部落曾有三代首领尊号炎帝）。传说姜姓部落的首领由于懂得用火而得到王位，所以称为炎帝。从神农起姜姓部落共有九代炎帝，神农生帝魁，魁生帝承，承生帝明，明生帝直，直生帝氂，氂生帝哀，哀生帝克，克生帝榆罔，传位五百三十年。
          div.w
            div.t 乔姓渊源列祖
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 画像
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 像赞
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 图腾分布家族树
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 郡望郡堂字辈
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 家学家风家训
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 乔氏名人艺文
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 乔氏家谱宗系简介
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
          div.w
            div.t 附录
            div.p 乔姓，是现行常见的姓氏。分布很广，今北京，上海，江苏新沂，江苏宿迁，江苏盐城，河南开封，河南商丘，河南漯河，河南周口，河南滑县，河北尚义，河北魏县，山东泰安、宁阳、泗水、平邑、龙口，内蒙古乌海，山西(介休、太原、平遥、祁县），新疆塔城，安徽泾县，广东新会，广西田林，云南泸水，四川合江、河南项城等地均有分布。汉族、满族，蒙古族、回族、傣族、苗族、布依族、傈僳族、锡伯族、达斡尔族等多个民族有此姓。后汉有乔扈，云中太守；唐代有乔知之，冯翊人，左司郎中；元代有著名曲作家乔吉，太原人。当代有乔冠华、乔羽、乔荣章等。
</template>

<script type="text/ecmascript-6">
  // 通谱总论
  import BreadCrumbs from '@/components/BreadCrumbs'
  import Sidebar from '@/components/Sidebar'
  import MainArticle from '@/components/MainArticle'

  export default {
    data() {
      return {
        sidebarItems: []
      }
    },
    mounted() {
      this.init()
    },
    methods: {
      init() {
        this.getSidebarItems()
      },
      getSidebarItems() {
        this.sidebarItems = [
          {
            anchor: '',
            name: '引论'
          },
          {
            anchor: '',
            name: '序'
          },
          {
            anchor: '',
            name: '凡例'
          },
          {
            anchor: '',
            name: '中华民族共祖'
          },
          {
            anchor: '',
            name: '乔姓渊源列祖'
          },
          {
            anchor: '',
            name: '画像'
          },
          {
            anchor: '',
            name: '像赞'
          },
          {
            anchor: '',
            name: '图腾分布家族树'
          },
          {
            anchor: '',
            name: '郡望郡堂字辈'
          },
          {
            anchor: '',
            name: '家学家风家训'
          },
          {
            anchor: '',
            name: '乔氏名人艺文'
          },
          {
            anchor: '',
            name: '乔氏家谱宗系简介'
          },
          {
            anchor: '',
            name: '附录'
          }
        ]
      },
      itemClick(item) {
        console.log('item', item)
      }
    },
    components: {
      BreadCrumbs,
      Sidebar,
      MainArticle
    }
  }
</script>

<style scoped lang="stylus" rel="stylesheet/stylus">
  .pandect
    margin 0 0 164px
    .article
      padding-top 41px
      padding-bottom 52px
      .w
        &+.w
          margin-top 46px
        .t
          text-align center
          font-size 24px
          line-height 1em
        .p
          font-size 16px
          line-height 24px
          margin-top 33px
</style>
